import matplotlib.pyplot as plt

plt.rcParams['font.sans-serif'] = ['SimHei']  # 设置中文字体为黑体
plt.rcParams['axes.unicode_minus'] = False  # 解决负号显示问题

# 年份数据
years = list(range(1860, 2011, 10))

# 不同年龄段的数据
under_5 = [15.4, 14.3, 13.8, 12.2, 12.1, 11.6, 10.9, 9.3, 8, 10.7, 11.3, 8.4, 7.2, 7.6, 6.8, 6.8]
age_5_to_19 = [35.8, 35.4, 34.3, 33.9, 32.3, 30.4, 29.8, 29.5, 26.4, 23.2, 27.1, 29.5, 24.8, 21.3, 21.8, 20.7]
age_20_to_44 = [35.7, 35.4, 35.9, 36.9, 37.7, 39, 38.4, 38.3, 38.9, 37.6, 32.2, 31.7, 37.1, 40.1, 37, 35.4]
age_45_to_64 = [10.4, 11.9, 12.6, 13.1, 13.7, 14.6, 16.1, 17.4, 19.8, 20.3, 20.1, 20.6, 19.6, 18.6, 22, 24.6]
age_65_plus = [2.7, 3, 3.4, 3.9, 4.1, 4.3, 4.7, 5.4, 6.8, 8.1, 9.2, 9.8, 11.3, 12.5, 12.4, 12.4]

# 绘图
plt.stackplot(years, under_5, age_5_to_19, age_20_to_44, age_45_to_64, age_65_plus,
              labels=['低于5岁', '5到19岁', '20到44岁', '45到64岁', '65岁'])
plt.legend(loc='upper left')
plt.title('美国1860年—2005年人口老龄化')
plt.xlabel('年份')
plt.ylabel('比例数据')
plt.show()
